package com.yunseong.lostark

enum class Materials(
        val price: Double
) {
        
        명예의_파편(0.3975),
        운명의_파편(0.0995),
        최상급_오레하_융화제(50.6),
        아비도스_융화_재료(73.3),
        찬란한_명예의_돌파석(31.0),
        운명의_돌파석(19.0),
        정제된_수호강석(0.4),
        운명의_수호석(0.35),
        정제된_파괴강석(0.82),
        운명의_파괴석(4.14),
        태양의_축복(15.2),
        태양의_은총(33.7),
        태양의_가호(86.7),
        빙하의_숨결(171.3),
        용암의_숨결(573.7),
        장인의_재봉술1(1200.0),
        장인의_재봉술2(3800.0),
        장인의_야금술1(1799.0),
        장인의_야금술2(9000.0),
        골드(1.0),
        Blank(0.0)
}